#include "stdafx.h"
#include "Menu.h"


Menu::Menu()
{}


Menu::~Menu()
{}

void Menu::Start()
{
	system("cls"); //очистка экрана
	cout << "\n\t ====================================";
	cout << "\n\t Система управления абонентами компании";
	cout << "\n\t ====================================";
	cout << "\n\t      1 - Добавить абонента";
	cout << "\n\t      2 - Удалить абонента";
	cout << "\n\t      3 - Найти абонента по номеру договора";
	cout << "\n\t      4 - Найти абонента по номеру телефона";
	cout << "\n\t      5 - Найти абонента по имени";
	cout << "\n\t      6 - Найти абонента по дате заключения договора";
	cout << "\n\t      7 - Выйти из программы";
	cout << "\n\t ====================================";

	cout << "\n Выберите нужное действие: ";
	cin >> choice;
}

void Menu::Finish()
{
	cout << "\n> Программа завершена \n\n";
}
bool Menu::Continue()
{
	cout << "\n> Еще (y/n)? - ";
	cin >> ans;
	return (ans == 'y');
}
int Menu::GetChoice()
{
	return choice;
}